Revit 2026 API

# RenderNode Properties

---

The RenderNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NodeName | A readable name of the output node. |

#### Reference

RenderNode Class

Autodesk.Revit.DB Namespace